Revit 2024 API
BuiltInFailures.OverlapFailures.WallRoomSeparationOverlap Property
 A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries. Shorten or delete the room separation line to remove the overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WallRoomSeparationOverlap { get; }
Visual Basic
Public Shared ReadOnly Property WallRoomSeparationOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WallRoomSeparationOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace